// 영화정보객체 JS : JS4-1.배열과객체_object.js

// 이승준 객체
var motoraObj = {
  // 1.영화제목
  제목: "레미제라블",
  // 2. 감독
  감독: "톰 후퍼",
  // 3. 배우
  배우: "휴 잭맨, 러셀 크로우",
  // 4. 장르
  장르: "드라마, 뮤지컬, 로맨스",
  // 5. 관람가
  관람가: "12세 이상 관람가",
  // 6. 예고편
  예고편: function () {
    // 1. 호출확인
    // alert("예고편");

    // 플레이함수 호출
    playMv("Qei594KgLgM");
  }, // 예고편 메서드 //
}; // motoraObj 객체 //

var tomObj = {
  // 1.영화제목
  제목: "포레스트 검프",
  // 2. 감독
  감독: "로버트 저메키스",
  // 3. 배우
  배우: "톰 행크스",
  // 4. 장르
  장르: "드라마,코미디",
  // 5. 관람가
  관람가: "12세 관람가",
  // 6. 예고편
  예고편: function () {
    // 1. 호출확인
    // alert("예고편");

    // 플레이함수 호출
    playMv("wM67yX1-0NI");
  }, ///// 예고편 메서드 ////
}; ///////////// tomObj 객체 //////////////


// 우새미 객체
var SMObj = {
  // 1. 영화제목
  제목: "영웅",
  // 2. 감독
  감독: "윤제균",
  // 3. 배우
  배우: "정성화, 김고은",
  // 4. 장르
  장르: "드라마, 뮤지컬",
  // 5. 관람가
  관람가: "12세 관람가",
  // 6. 예고편
  예고편: function () {
    // alert("예고편:");

    // 플레이함수 호출
    playMv("K4KR4J-yBMw");
  }, //////// 예고편 메서드 //////////
}; ///////////////// SMObj 객체 ///////////

// 이다인 객체
var leaveObj = {
  // 1. 영화제목
  제목: "헤어질 결심",
  // 2. 감독
  감독: "박찬욱",
  // 3. 배우
  배우: "탕웨이, 박해일",
  // 4. 장르
  장르: "로맨스, 드라마, 스릴러",
  // 5. 관람가
  관람가: "15세 관람가",
  // 6. 예고편
  예고편: function () {
    // 1. 호출확인
    // console.log("예고편");

    // 플레이 함수 호출
    playMv("i50tT8n9fp8");
  }, // 예고편 메서드
}; /// leaveObJ 객체 ///////

var tomObjj = {
  // 1. 영화제목
  제목: "명탐정 코난: 할로윈의 신부",
  // 2. 감독
  감독: "미츠나카 스스무",
  // 3. 배우
  배우: "코난",
  // 4. 장르
  장르: "판타지",
  // 5. 관람가
  관람가: "18세 관람가",
  // 6. 예고편
  예고편: function(){
      // 1. 호출확인
      // alert("예고편");

      // 플레이함수 호출
      playMv("olv1UFC9Lno");

  } ///// 예고편 메서드 ////
}; ///////////// tomObj 객체 //////////////
